<?php if (!defined('TS_DEV')) { header('HTTP/1.1 403 Forbidden'); die(); }

$TABLE_STORES = 'ts_stores';
$TABLE_PRODUCTS = 'ts_products';

if (TS_DEV) {
	$ts_db->exec('DROP TABLE IF EXISTS ' . $TABLE_STORES);
	$ts_db->exec('DROP TABLE IF EXISTS ' . $TABLE_PRODUCTS);
}
if (!$ts_db->exec('CREATE TABLE ' . $TABLE_STORES . ' (s_id INT AUTO_INCREMENT, s_name VARCHAR(63), s_icon VARCHAR(511), s_deliv FLOAT, s_price FLOAT, s_rating FLOAT, s_p_n FLOAT, s_fee FLOAT, s_price_min FLOAT, PRIMARY KEY (s_id)) ENGINE=InnoDB DEFAULT CHARSET=' . TsConfig::get('db', 'charset'))) {
	echo 'could not create table ', $TABLE_STORES;
	exit(-1);
}
if (!$ts_db->exec('CREATE TABLE ' . $TABLE_PRODUCTS . ' (p_id INT AUTO_INCREMENT, p_name VARCHAR(63), p_price FLOAT, s_id INT, PRIMARY KEY (p_id)) ENGINE=InnoDB DEFAULT CHARSET=' . TsConfig::get('db', 'charset'))) {
	echo 'could not create table ', $TABLE_PRODUCTS;
	exit(-1);
}
if (TS_DEV) {
	if (!$ts_db->exec('INSERT INTO ' . $TABLE_STORES . ' 
	(s_name, s_icon, s_deliv, s_price, s_rating, s_p_n, s_fee, s_price_min) 
	VALUES 
	(\'隆延茶铺（六道口店）\', \'favicon.ico\', 41, 21, 9.7, 13, 7, 29),
	(\'快乐柠檬（北京五道口店）\', \'favicon.ico\', 36, 13, 9.2, 15, 0, 15), 
	(\'书亦烧仙草（海淀食宝街店）\', \'favicon.ico\', 55, 13, 9.5, 6, 6, 20),
	(\'喜茶（北京清华东南门店）\', \'favicon.ico\', 75, 33, 9.6, 8, 6, 30),
	(\'LELECHA乐乐茶（五道口店）\', \'favicon.ico\', 68, 28, 9.7, 6, 1, 30), 
	(\'1点点（六道口店）\', \'favicon.ico\', 42, 17, 9.4, 15, 5.5, 20), 
	(\'凑凑（海淀黄庄店）\', \'favicon.ico\', 46, 20, 9.8, 5, 5, 20), 
	(\'兰喵鲜奶\', \'favicon.ico\', 32, 18, 9.9, 6, 3, 15), 
	(\'一芳台湾水果茶（五道口店）\', \'favicon.ico\', 34, 17, 9.4, 8, 0, 20)
	')) {
		echo 'could not insert into ', $TABLE_STORES;
		exit(-1);
	}
	if (!$ts_db->exec('INSERT INTO ' . $TABLE_PRODUCTS . ' (p_name, p_price, s_id) VALUES 
		(\'隆记米酿奶茶\', 17, 1), 
		(\'松风乌龙奶茶\', 16, 1), 
		(\'暖身姜母奶茶\', 16, 1), 
		(\'醇享黑糖奶茶\', 16, 1), 
		(\'南瓜丝绒鲜奶\', 24, 1), 
		(\'醪糟鲜奶（含酒精）\', 23, 1), 
		(\'椰浆红豆鲜奶\', 24, 1), 
		(\'青玉抹茶\', 17, 1), 
		(\'荔枝红茶纯茶\', 13, 1), 
		(\'黑岩红抹\', 17, 1), 
		(\'玫瑰普洱纯茶\', 13, 1), 
		(\'银毫普洱纯茶\', 13, 1), 
		(\'杏桃金萱纯茶\', 16, 1), 
		
		(\'OREO曲奇奶茶\', 15, 2), 
		(\'芋圆小丸子奶茶\', 16, 2), 
		(\'紫芋小丸子珍珠奶茶\', 16, 2), 
		(\'网红蛋糕风味奶茶\', 20, 2), 
		(\'半熟蛋糕珍珠奶茶\', 17, 2), 
		(\'珍珠奶茶\', 14, 2), 
		(\'芒橙百香四季春茶\', 17, 2), 
		(\'大满贯布丁奶茶\', 17, 2), 
		(\'柠檬菠萝饮\', 16, 2), 
		(\'红豆布丁奶茶\', 15, 2), 
		(\'岩盐芝士奶茶\', 17, 2), 
		(\'草莓半熟蛋糕奶茶\', 20, 2), 
		(\'莓莓满满柠檬爽\', 18, 2), 
		(\'云顶可可\', 18, 2), 
		(\'养乐多柠檬绿茶\', 20, 2), 

		(\'书亦烧仙草（大杯）\', 15, 3), 
		(\'布蕾小啵啵奶茶\', 15, 3), 
		(\'杨枝甘露烧仙草\', 16, 3), 
		(\'小芋圆烧仙草\', 14, 3), 
		(\'椰椰烧仙草（大杯）\', 16, 3), 
		(\'黑糖小芋圆奶茶\', 15, 3),

		(\'芒橙百香四季春茶\', 17, 3), 
		(\'大满贯布丁奶茶\', 17, 3), 
		(\'柠檬菠萝饮\', 16, 3), 
		(\'红豆布丁奶茶\', 15, 3), 
		(\'岩盐芝士奶茶\', 17, 3), 
		(\'草莓半熟蛋糕奶茶\', 30, 3), 
		(\'莓莓满满柠檬爽\', 18, 3), 
		(\'云顶可可\', 18, 3), 
		(\'养乐多柠檬绿茶\', 30, 3), 

		(\'多肉葡萄\', 29, 4), 
		(\'热芋泥波波奶茶\', 28, 4), 
		(\'酒酿桂花冻\', 26, 4),
		(\'雪山香草拿铁\', 29, 4), 
		(\'多肉芒芒甘露\', 27, 4), 
		(\'厚烧蛋糕波波奶茶\', 28, 4),
		(\'雪山香草拿铁\', 29, 4), 
		(\'满陇金桂\', 16, 4), 

		(\'桃桃乌龙鲜奶茶\', 19, 5), 
		(\'草莓桃子酪酪\', 30, 5), 
		(\'黑糖波霸脏脏茶\', 21, 5),
		(\'杨枝甘露酪酪\', 29, 5), 
		(\'芒果酪酪\', 29, 5), 
		(\'玫瑰蜜瓜酪酪\', 28, 5),

		(\'（大杯）四季奶青\', 14, 6), 
		(\'（大杯）波霸奶茶\', 14, 6), 
		(\'（中杯）豆花奶茶\', 15, 6),
		(\'（中杯）抹茶奶茶\', 34, 6), 
		(\'（中杯）四季奶青\', 11, 6), 
		(\'（大杯）百香奶青+珍波椰\', 15, 6),
		(\'（中杯）可可豆花燕麦奶茶\', 20, 6), 
		(\'（大杯）可可豆花燕麦奶茶\', 28, 6), 
		(\'（大杯）芒果酸奶绿\', 24, 6), 
		(\'（中杯）芒果酸奶绿\', 19, 6),
		(\'（中杯）燕麦黑糖乌龙奶\', 15, 6), 
		(\'（大杯）云朵芒果青\', 24, 6), 
		(\'（大杯）燕麦黑糖乌龙奶\', 19, 6),
		(\'（中杯）云朵芒果青\', 19, 6), 
		(\'云朵百香青\', 18, 6), 

		(\'大红袍珍珠奶茶\', 24, 7), 
		(\'茉香奶绿\', 20, 7), 
		(\'龙井粉荔\', 26, 7),
		(\'铁观音奶茶\', 20, 7), 
		(\'香梅绿茶\', 24, 7),

		(\'芋头泥石流\', 22, 8), 
		(\'芒芒奶\', 20, 8), 
		(\'桂花弄奶\', 18, 8),
		(\'米酒酿奶\', 18, 8), 
		(\'莓莓酸奶\', 21, 8), 
		(\'绿宝石奶\', 20, 8),

		(\'金凤粉粿椰奶L\', 24, 9), 
		(\'金凤粉粿椰奶M\', 20, 9), 
		(\'葡萄酸奶玉露L\', 21, 9), 
		(\'葡萄酸奶玉露M\', 17, 9), 
		(\'杨枝甘露L\', 23, 9), 
		(\'杨枝甘露M\', 19, 9), 
		(\'花酿乌龙鲜奶茶L\', 22, 9), 
		(\'花酿乌龙鲜奶茶M\', 18, 9) 
	')) {
		echo 'could not insert into ', $TABLE_PRODUCTS;
		exit(-1);
	}
}
